_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Определители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Определители</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыЗатратСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРасценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПриВыборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыНормативныхСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыНормативныхСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПусконаладочныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтноСтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеставрационноВосстановительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаЭксплуатациюМашин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогШтучныхКонструкций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прейскурант0608НаСборныйЖелезобетон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантыНаРемонтТехнологическогоОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантОптовыхЦенНаМатериалыИОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеныНаМестныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УкрупненныеСметныеНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеЗатратыВЗимнееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержаниеОбъектовГородскойСреды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременныеЗданияИСооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калькуляция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Определители/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Пытается найти определитель но типу нормативного сборника.
//
// Параметры:
//		ТипНормативногоСборника - ПеречислениеСсылка.ТипыНормативныхСборников.
//
// Возвращаемое значение:
//		ТекСсылка - СправочникСсылка.СМ_Определители, Неопределено - 
//					ссылка на определитель, Неопределено - если неоднозначно.
//
Функция НайтиПоТипуНормативногоСборника(ТипНормативногоСборника) Экспорт
	
	Если ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.ПустаяСсылка() Тогда
		Возврат Неопределено;
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("19");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("6");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.Перебазировка Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("17");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("1");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.РемонтноСтроительныеРаботы Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("1");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаЭксплуатациюМашин Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("1");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.Транспортировка Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("17");
	ИначеЕсли ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников.ЦеныНаМестныеМатериалы Тогда
		Возврат Справочники.СМ_Определители.НайтиПоКоду("11");
	Иначе
		Возврат Справочники.СМ_Определители.НайтиПоКоду("0");
	КонецЕсли;         
	
КонецФункции

#КонецОбласти
